Revit 2027 API
DefinitionGroups.GetEnumerator Method
Retrieves an enumerator to the collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual IEnumerator<DefinitionGroup> GetEnumerator()
Public Overridable Function GetEnumerator As IEnumerator(Of DefinitionGroup)
public:
virtual IEnumerator<DefinitionGroup^>^ GetEnumerator()
abstract GetEnumerator : unit -> IEnumerator<DefinitionGroup>
override GetEnumerator : unit -> IEnumerator<DefinitionGroup>
Return Value
IEnumerator<DefinitionGroup>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
DefinitionGroups Class
Autodesk.Revit.DB Namespace